CSI API ETABS v1

# cPointElmGetPatternValue Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetPatternValue(
    	string Name,
    	string PatternName,
    	ref double Value
    )

    Function GetPatternValue (
    	Name As String,
    	PatternName As String,
    	ByRef Value As Double
    ) As Integer

    Dim instance As cPointElm
    Dim Name As String
    Dim PatternName As String
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.GetPatternValue(Name,
    	PatternName, Value)

    int GetPatternValue(
    	String^ Name,
    	String^ PatternName,
    	double% Value
    )

    abstract GetPatternValue :
            Name : string *
            PatternName : string *
            Value : float byref -> int

#### Parameters

Name

    Type: SystemString

PatternName

    Type: SystemString

Value

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cPointElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com